In [2]:
import numpy as np #Importing numpy aliasing it as NP
import pandas as pd #Importing Pandas aliasing it as pd
import matplotlib.pyplot as plt #Importing matplotlib aliasing it as plt
act17 = pd.read_csv('../data/act_2017.csv', usecols=[0, 1, 6]) #Importing all the ACT and SAT datasets relevant to my research
act18 = pd.read_csv('../data/act_2018.csv')
act19 = pd.read_csv('../data/act_2019.csv')
sat17 = pd.read_csv('../data/sat_2017.csv')
sat18 = pd.read_csv('../data/sat_2018.csv')
sat19 = pd.read_csv('../data/sat_2019.csv')

#### Displaying the data, ACT 17 has additional columns not included in ACT 18 and ACT 19 but the merging process should automatically remove them

In [3]:
act17.head() #Displaying ACT17 Data

act18.head() #Displaying ACT18 Data

act19.head() #Displaying ACT19 Data

        State Participation  Composite
0     Alabama          100%       18.9
1      Alaska           38%       20.1
2     Arizona           73%       19.0
3    Arkansas          100%       19.3
4  California           23%       22.6

#### Getting a rough sense of what each major ACT column has.

In [4]:
act17['Participation'].describe() 

act18['Participation'].describe()

act19['Participation'].describe()

act17['Composite'].describe()

act18['Composite'].describe()

act19['Composite'].describe()

act17['State'].describe()

act18['State'].describe()

act19['State'].describe()

count         52
unique        52
top       Nevada
freq           1
Name: State, dtype: object

In [5]:
act17.duplicated(subset=['State'])

act19.duplicated(subset=['State'])

act18.duplicated(subset=['State'])

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20     True
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30    False
31    False
32    False
33    False
34    False
35    False
36    False
37    False
38    False
39    False
40    False
41    False
42    False
43    False
44    False
45    False
46    False
47    False
48    False
49    False
50    False
51    False
dtype: bool

#### Getting rid of the duplicate Maine. Making sure it doesn't have differing values first.

In [6]:
act18.loc[act18['State'] == 'Maine']

    State Participation  Composite
19  Maine            7%       24.0
20  Maine            7%       24.0

In [7]:
act18.drop([19], inplace = True)

In [8]:
act18.loc[act18['State'] == 'Maine']

    State Participation  Composite
20  Maine            7%       24.0

##### To maintain consistency, creating a national row for ACT 18 so that when I merge the ACT datasets, I'm not losing the National data from ACT17 and ACT19. If the nulls from this row interfere with the data or if I don't have any use for the national row, I will drop the row when analyzing the data.

In [9]:
dict_nat_18 = {'State': 'National', 'Participation': None, 'Composite': None}

act18 = act18.append(dict_nat_18, ignore_index = True)

##### Renaming columns for the eventual merge, with the final two digits of the year seperating the columns apart

In [10]:
act19.rename(columns = {'State':'state','Participation':'participation19', 'Composite': 'composite19'}, inplace = True)

act18.rename(columns = {'State':'state','Participation':'participation18', 'Composite': 'composite18'}, inplace = True)

act17.rename(columns = {'State':'state','Participation': 'participation17', 'Composite': 'composite17'}, inplace = True)

act18['state'].replace({'District of columbia':'District of Columbia'}, inplace = True)

Help with renaming columns: https://stackoverflow.com/questions/11346283/renaming-column-names-in-pandas

### Merging the three datasets into one ACT dataset with all the values I'm looking for.

In [11]:
acttotal = pd.merge(pd.merge(act17,act18,on='state'),act19,on='state')

Merge Help https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html

##### Renaming all the columns before the merge to avoid any confusion once all the data is in one dataset

In [12]:
sat17.rename(columns = {'State':'state','Participation': 'participation17', 'Evidence-Based Reading and Writing': 'ebrw17',
                       'Math': 'math17', 'Total':'total17'}
             , inplace = True)
sat17.head()

        state participation17  ebrw17  math17  total17
0     Alabama              5%     593     572     1165
1      Alaska             38%     547     533     1080
2     Arizona             30%     563     553     1116
3    Arkansas              3%     614     594     1208
4  California             53%     531     524     1055

In [13]:
sat18.rename(columns = {'State':'state', 'Participation': 'participation18', 'Evidence-Based Reading and Writing': 'ebrw18',
                       'Math': 'math18', 'Total':'total18'}
             , inplace = True)
sat18.head()

        state participation18  ebrw18  math18  total18
0     Alabama              6%     595     571     1166
1      Alaska             43%     562     544     1106
2     Arizona             29%     577     572     1149
3    Arkansas              5%     592     576     1169
4  California             60%     540     536     1076

In [14]:
sat19.rename(columns = {'State':'state', 'Participation Rate': 'participation19', 'EBRW': 'ebrw19',
                       'Math': 'math19', 'Total':'total19'}
             , inplace = True)
sat19.head()

        state participation19  ebrw19  math19  total19
0     Alabama              7%     583     560     1143
1      Alaska             41%     556     541     1097
2     Arizona             31%     569     565     1134
3    Arkansas              6%     582     559     1141
4  California             63%     534     531     1065

##### Creating numpy arrays for the SAT and ACT states

In [15]:
states19sat = sat19['state'].sort_values().values
states17sat = sat17['state'].sort_values().values
states18sat = sat18['state'].sort_values().values
states17act = act17['state'].sort_values().values
states18act = act18['state'].sort_values().values
states19act = act19['state'].sort_values().values
states18act

array(['Alabama', 'Alaska', 'Arizona', 'Arkansas', 'California',
       'Colorado', 'Connecticut', 'Delaware', 'District of Columbia',
       'Florida', 'Georgia', 'Hawaii', 'Idaho', 'Illinois', 'Indiana',
       'Iowa', 'Kansas', 'Kentucky', 'Louisiana', 'Maine', 'Maryland',
       'Massachusetts', 'Michigan', 'Minnesota', 'Mississippi',
       'Missouri', 'Montana', 'National', 'Nebraska', 'Nevada',
       'New Hampshire', 'New Jersey', 'New Mexico', 'New York',
       'North Carolina', 'North Dakota', 'Ohio', 'Oklahoma', 'Oregon',
       'Pennsylvania', 'Rhode Island', 'South Carolina', 'South Dakota',
       'Tennessee', 'Texas', 'Utah', 'Vermont', 'Virginia', 'Washington',
       'West Virginia', 'Wisconsin', 'Wyoming'], dtype=object)

##### Creating a variable with all the states in ACTTotal and the 50 states needed for the analysis. Just to make sure the SAT datasets will remain consistent with the ACT datasets.

In [16]:
acttotalstates = acttotal['state'].sort_values().values
acttotalstates

array(['Alabama', 'Alaska', 'Arizona', 'Arkansas', 'California',
       'Colorado', 'Connecticut', 'Delaware', 'District of Columbia',
       'Florida', 'Georgia', 'Hawaii', 'Idaho', 'Illinois', 'Indiana',
       'Iowa', 'Kansas', 'Kentucky', 'Louisiana', 'Maine', 'Maryland',
       'Massachusetts', 'Michigan', 'Minnesota', 'Mississippi',
       'Missouri', 'Montana', 'National', 'Nebraska', 'Nevada',
       'New Hampshire', 'New Jersey', 'New Mexico', 'New York',
       'North Carolina', 'North Dakota', 'Ohio', 'Oklahoma', 'Oregon',
       'Pennsylvania', 'Rhode Island', 'South Carolina', 'South Dakota',
       'Tennessee', 'Texas', 'Utah', 'Vermont', 'Virginia', 'Washington',
       'West Virginia', 'Wisconsin', 'Wyoming'], dtype=object)

In [17]:
def state_excluded(states):
    lst = []
    for state in states:
        if state not in acttotalstates:
            lst.append(state)
    print(lst)

##### Discovering potential duplicates in the SAT datasets and discovering what states will be excluded from the analysis because the ACT datasets might not have them.

In [18]:
sat19.duplicated(subset=['state'])

sat18.duplicated(subset=['state'])

sat17.duplicated(subset=['state'])

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30    False
31    False
32    False
33    False
34    False
35    False
36    False
37    False
38    False
39    False
40    False
41    False
42    False
43    False
44    False
45    False
46    False
47    False
48    False
49    False
50    False
dtype: bool

##### Because SAT 19 is the only dataset with the Virgin Islands and Puerto Rico, it's relatively easy to leave them off because it wouldn't affect any other SAT dataset. It will be automatically left out when we're doing the merge

In [19]:
state_excluded(states19sat)

['Puerto Rico', 'Virgin Islands']

In [20]:
state_excluded(states18sat)

[]

In [21]:
state_excluded(states17sat)

[]

### The actual merge itself of the SAT datasets

In [22]:
sattotal = pd.merge(pd.merge(sat17,sat18,on='state'),sat19,on='state')

##### Making sure everything in the dataset is in order and everything is fine post-merge

In [23]:
sattotal.head()

,state,participation17,ebrw17,math17,total17,participation18,ebrw18,math18,total18,participation19,ebrw19,math19,total19
0,Alabama,5%,593,572,1165,6%,595,571,1166,7%,583,560,1143
1,Alaska,38%,547,533,1080,43%,562,544,1106,41%,556,541,1097
2,Arizona,30%,563,553,1116,29%,577,572,1149,31%,569,565,1134
3,Arkansas,3%,614,594,1208,5%,592,576,1169,6%,582,559,1141
4,California,53%,531,524,1055,60%,540,536,1076,63%,534,531,1065

In [24]:
acttotal.duplicated(subset=['state'])

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30    False
31    False
32    False
33    False
34    False
35    False
36    False
37    False
38    False
39    False
40    False
41    False
42    False
43    False
44    False
45    False
46    False
47    False
48    False
49    False
50    False
51    False
dtype: bool

In [25]:
sattotal.duplicated(subset=['state'])

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30    False
31    False
32    False
33    False
34    False
35    False
36    False
37    False
38    False
39    False
40    False
41    False
42    False
43    False
44    False
45    False
46    False
47    False
48    False
49    False
50    False
dtype: bool

In [26]:
acttotal.head()

,state,participation17,composite17,participation18,composite18,participation19,composite19
0,National,60%,21.0,None,NaN,52%,20.7
1,Alabama,100%,19.2,100%,19.1,100%,18.9
2,Alaska,65%,19.8,33%,20.8,38%,20.1
3,Arizona,62%,19.7,66%,19.2,73%,19.0
4,Arkansas,100%,19.4,100%,19.4,100%,19.3

In [27]:
acttotal.shape
sattotal.shape

(51, 13)

In [28]:
acttotal.dtypes

state               object
participation17     object
composite17         object
participation18     object
composite18        float64
participation19     object
composite19        float64
dtype: object

In [29]:
sattotal.dtypes

state              object
participation17    object
ebrw17              int64
math17              int64
total17             int64
participation18    object
ebrw18              int64
math18              int64
total18             int64
participation19    object
ebrw19              int64
math19              int64
total19             int64
dtype: object

#### Converting all the percentages into floats

In [30]:
def to_percent(x, y):
    return x[y].str.rstrip('%').astype('float') / 100.0

In [31]:
acttotal['participation19'] = to_percent(acttotal, 'participation19')
acttotal['participation18'] = to_percent(acttotal, 'participation18')
acttotal['participation17'] = to_percent(acttotal, 'participation17')
acttotal.dtypes

state               object
participation17    float64
composite17         object
participation18    float64
composite18        float64
participation19    float64
composite19        float64
dtype: object

In [32]:
sattotal['participation19'] = to_percent(sattotal, 'participation19')
sattotal['participation18'] = to_percent(sattotal, 'participation18')
sattotal['participation17'] = to_percent(sattotal, 'participation17')
sattotal.dtypes

state               object
participation17    float64
ebrw17               int64
math17               int64
total17              int64
participation18    float64
ebrw18               int64
math18               int64
total18              int64
participation19    float64
ebrw19               int64
math19               int64
total19              int64
dtype: object

In [33]:
acttotal.head()

,state,participation17,composite17,participation18,composite18,participation19,composite19
0,National,0.60,21.0,NaN,NaN,0.52,20.7
1,Alabama,1.00,19.2,1.00,19.1,1.00,18.9
2,Alaska,0.65,19.8,0.33,20.8,0.38,20.1
3,Arizona,0.62,19.7,0.66,19.2,0.73,19.0
4,Arkansas,1.00,19.4,1.00,19.4,1.00,19.3

In [34]:
sattotal.head()

,state,participation17,ebrw17,math17,total17,participation18,ebrw18,math18,total18,participation19,ebrw19,math19,total19
0,Alabama,0.05,593,572,1165,0.06,595,571,1166,0.07,583,560,1143
1,Alaska,0.38,547,533,1080,0.43,562,544,1106,0.41,556,541,1097
2,Arizona,0.30,563,553,1116,0.29,577,572,1149,0.31,569,565,1134
3,Arkansas,0.03,614,594,1208,0.05,592,576,1169,0.06,582,559,1141
4,California,0.53,531,524,1055,0.60,540,536,1076,0.63,534,531,1065

##### Finding what's stopping composite17 from being read as a float datatype and correcting it

In [35]:
acttotal['composite17']

0      21.0
1      19.2
2      19.8
3      19.7
4      19.4
5      22.8
6      20.8
7      25.2
8      24.1
9      24.2
10     19.8
11     21.4
12     19.0
13     22.3
14     21.4
15     22.6
16     21.9
17     21.7
18     20.0
19     19.5
20     24.3
21     23.6
22     25.4
23     24.1
24     21.5
25     18.6
26     20.4
27     20.3
28     21.4
29     17.8
30     25.5
31     23.9
32     19.7
33     24.2
34     19.1
35     20.3
36     22.0
37     19.4
38     21.8
39     23.7
40     24.0
41     18.7
42     21.8
43     19.8
44     20.7
45     20.3
46     23.6
47     23.8
48     21.9
49     20.4
50     20.5
51    20.2x
Name: composite17, dtype: object

In [36]:
acttotal.at[51, 'composite17']='20.2'

In [37]:
acttotal['composite17'] = pd.to_numeric(acttotal['composite17'])

In [38]:
acttotal[['composite17']]

acttotal.dtypes

state               object
participation17    float64
composite17        float64
participation18    float64
composite18        float64
participation19    float64
composite19        float64
dtype: object

##### Using data from another website to create a dataset within pandas that ranks countries by GDP

In [39]:
STATEGDP19 = {'state':['District of Columbia', 'Massachusetts', 'New York', 'Alaska', 'North Dakota', 'California', 'Connecticut', 'Washington', 'Wyoming', 'Delaware', 'New Jersey', 'Maryland', 'Illinois', 'Texas', 'Colorado', 'Minnesota', 'Hawaii', 'New Hampshire', 'Virginia', 'Pennsylvania', 'Iowa', 'Kansas', 
                         'South Dakota', 'Oregon', 'Ohio', 'Wisconsin', 'Rhode Island', 'Louisiana', 'Utah', 'Oklahoma', 'Georgia', 'Nevada', 'Indiana', 'Vermont', 'North Carolina', 'Tennessee', 'Michigan', 'Missouri', 'New Mexico', 'Florida', 'Arizona', 'Montana', 'Maine', 'Kentucky', 'South Carolina', 'Alabama', 'Idaho', 'West Virginia', 'Arkansas', 'Mississippi', 'National'], 
                'gdp_rank_19':[1, 2, 3, 4, 5, 6 ,7 ,8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, None]}
GDPDF19 = pd.DataFrame(STATEGDP19)

In [40]:
GDPDF19.head()

                  state  gdp_rank_19
0  District of Columbia          1.0
1         Massachusetts          2.0
2              New York          3.0
3                Alaska          4.0
4          North Dakota          5.0

##### Making a dataframe (using outside information) that has all the states that has the SAT for free statewide in some capacity

In [41]:
satfree = {'state': ['Colorado', 'Connecticut', 'Delaware', 'District of Columbia', 'Idaho', 'Illinois', 'Maine', 'Michigan', 'New Hampshire', 'Rhode Island', 'West Virginia', 'Tennessee', 'South Carolina', 'Oklahoma', 'Ohio'],
          'sat_free':[True, True, True, True, True, True, True, True, True, True, True, True, True, True, True]}
satfree = pd.DataFrame(satfree)

In [42]:
satfree.head()

                  state  sat_free
0              Colorado      True
1           Connecticut      True
2              Delaware      True
3  District of Columbia      True
4                 Idaho      True

##### Making a dataframe (using outside information) that has all the states that has the ACT for free statewide in some capacity

In [43]:
actfree = {'state': ['Hawaii', 'Kentucky', 'Louisiana', 'Nebraska', 'North Carolina', 'North Dakota', 'Ohio', 'Oklahoma', 'Tennessee', 'Wyoming', 'Alabama', 'Arkansas', 'Mississippi', 'Montana', 'South Carolina', 'Utah', 'Wisconsin'],
           'act_free':[True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True]
    }
actfree = pd.DataFrame(actfree)

In [44]:
actfree.head()

            state  act_free
0          Hawaii      True
1        Kentucky      True
2       Louisiana      True
3        Nebraska      True
4  North Carolina      True

##### Merging the acttotal and sattotal datasets with the gdp rankings

In [45]:
sattotal = pd.merge(sattotal, GDPDF19, on='state')

In [46]:
sattotal.head()

,state,participation17,ebrw17,math17,total17,participation18,ebrw18,math18,total18,participation19,ebrw19,math19,total19,gdp_rank_19
0,Alabama,0.05,593,572,1165,0.06,595,571,1166,0.07,583,560,1143,46.0
1,Alaska,0.38,547,533,1080,0.43,562,544,1106,0.41,556,541,1097,4.0
2,Arizona,0.30,563,553,1116,0.29,577,572,1149,0.31,569,565,1134,41.0
3,Arkansas,0.03,614,594,1208,0.05,592,576,1169,0.06,582,559,1141,49.0
4,California,0.53,531,524,1055,0.60,540,536,1076,0.63,534,531,1065,6.0

In [47]:
acttotal = pd.merge(acttotal, GDPDF19, on='state')

In [48]:
acttotal.head()

,state,participation17,composite17,participation18,composite18,participation19,composite19,gdp_rank_19
0,National,0.60,21.0,NaN,NaN,0.52,20.7,NaN
1,Alabama,1.00,19.2,1.00,19.1,1.00,18.9,46.0
2,Alaska,0.65,19.8,0.33,20.8,0.38,20.1,4.0
3,Arizona,0.62,19.7,0.66,19.2,0.73,19.0,41.0
4,Arkansas,1.00,19.4,1.00,19.4,1.00,19.3,49.0

In [49]:
sattotal.shape

(50, 14)

In [50]:
acttotal.shape

(51, 8)

#### Merging the sattotal and acttotal datasets with the free dataframes

In [51]:
sattotal = pd.merge(sattotal, satfree, on='state', how = 'left')

In [52]:
sattotal.tail()

,state,participation17,ebrw17,math17,total17,participation18,ebrw18,math18,total18,participation19,ebrw19,math19,total19,gdp_rank_19,sat_free
45,Virginia,0.65,561,541,1102,0.68,567,550,1117,0.68,567,551,1119,19.0,NaN
46,Washington,0.64,541,534,1075,0.69,543,538,1081,0.70,539,535,1074,8.0,NaN
47,West Virginia,0.14,558,528,1086,0.28,513,486,999,0.99,483,460,943,48.0,True
48,Wisconsin,0.03,642,649,1291,0.03,641,653,1294,0.03,635,648,1283,26.0,NaN
49,Wyoming,0.03,626,604,1230,0.03,633,625,1257,0.03,623,615,1238,9.0,NaN

In [53]:
sattotal.shape

(50, 15)

In [54]:
acttotal = pd.merge(acttotal, actfree, on='state', how = 'left')

In [55]:
acttotal.head()

,state,participation17,composite17,participation18,composite18,participation19,composite19,gdp_rank_19,act_free
0,National,0.60,21.0,NaN,NaN,0.52,20.7,NaN,NaN
1,Alabama,1.00,19.2,1.00,19.1,1.00,18.9,46.0,True
2,Alaska,0.65,19.8,0.33,20.8,0.38,20.1,4.0,NaN
3,Arizona,0.62,19.7,0.66,19.2,0.73,19.0,41.0,NaN
4,Arkansas,1.00,19.4,1.00,19.4,1.00,19.3,49.0,True

In [56]:
acttotal.shape

(51, 9)

#### Defining a new function to turn the NaN values into False values

In [57]:
def clean_free(free_cell):
    if free_cell != True:
        return False
    if free_cell == True:
        return True

In [58]:
acttotal['act_free'] = acttotal['act_free'].map(clean_free)

In [59]:
acttotal.head()

,state,participation17,composite17,participation18,composite18,participation19,composite19,gdp_rank_19,act_free
0,National,0.60,21.0,NaN,NaN,0.52,20.7,NaN,False
1,Alabama,1.00,19.2,1.00,19.1,1.00,18.9,46.0,True
2,Alaska,0.65,19.8,0.33,20.8,0.38,20.1,4.0,False
3,Arizona,0.62,19.7,0.66,19.2,0.73,19.0,41.0,False
4,Arkansas,1.00,19.4,1.00,19.4,1.00,19.3,49.0,True

In [60]:
acttotal.dtypes

state               object
participation17    float64
composite17        float64
participation18    float64
composite18        float64
participation19    float64
composite19        float64
gdp_rank_19        float64
act_free              bool
dtype: object

In [61]:
sattotal['sat_free'] = sattotal['sat_free'].map(clean_free)

In [62]:
sattotal.tail()

,state,participation17,ebrw17,math17,total17,participation18,ebrw18,math18,total18,participation19,ebrw19,math19,total19,gdp_rank_19,sat_free
45,Virginia,0.65,561,541,1102,0.68,567,550,1117,0.68,567,551,1119,19.0,False
46,Washington,0.64,541,534,1075,0.69,543,538,1081,0.70,539,535,1074,8.0,False
47,West Virginia,0.14,558,528,1086,0.28,513,486,999,0.99,483,460,943,48.0,True
48,Wisconsin,0.03,642,649,1291,0.03,641,653,1294,0.03,635,648,1283,26.0,False
49,Wyoming,0.03,626,604,1230,0.03,633,625,1257,0.03,623,615,1238,9.0,False

In [63]:
sattotal.dtypes

state               object
participation17    float64
ebrw17               int64
math17               int64
total17              int64
participation18    float64
ebrw18               int64
math18               int64
total18              int64
participation19    float64
ebrw19               int64
math19               int64
total19              int64
gdp_rank_19        float64
sat_free              bool
dtype: object

#### Adding the additional free column to the total datasets

In [64]:
acttotal = pd.merge(acttotal, satfree, on='state', how = 'left')

In [65]:
acttotal['sat_free'] = acttotal['sat_free'].map(clean_free)

In [66]:
acttotal.tail()

,state,participation17,composite17,participation18,composite18,participation19,composite19,gdp_rank_19,act_free,sat_free
46,Virginia,0.29,23.8,0.24,23.9,0.21,24.0,19.0,False,False
47,Washington,0.29,21.9,0.24,22.2,0.24,22.1,8.0,False,False
48,West Virginia,0.69,20.4,0.65,20.3,0.49,20.8,48.0,False,True
49,Wisconsin,1.00,20.5,1.00,20.5,1.00,20.3,26.0,True,False
50,Wyoming,1.00,20.2,1.00,20.0,1.00,19.8,9.0,True,False

In [67]:
acttotal.dtypes

state               object
participation17    float64
composite17        float64
participation18    float64
composite18        float64
participation19    float64
composite19        float64
gdp_rank_19        float64
act_free              bool
sat_free              bool
dtype: object

In [68]:
acttotal.shape

(51, 10)

In [69]:
sattotal = pd.merge(sattotal, actfree, on='state', how = 'left')

In [70]:
sattotal['act_free'] = sattotal['act_free'].map(clean_free)

In [71]:
sattotal.head()

,state,participation17,ebrw17,math17,total17,participation18,ebrw18,math18,total18,participation19,ebrw19,math19,total19,gdp_rank_19,sat_free,act_free
0,Alabama,0.05,593,572,1165,0.06,595,571,1166,0.07,583,560,1143,46.0,False,True
1,Alaska,0.38,547,533,1080,0.43,562,544,1106,0.41,556,541,1097,4.0,False,False
2,Arizona,0.30,563,553,1116,0.29,577,572,1149,0.31,569,565,1134,41.0,False,False
3,Arkansas,0.03,614,594,1208,0.05,592,576,1169,0.06,582,559,1141,49.0,False,True
4,California,0.53,531,524,1055,0.60,540,536,1076,0.63,534,531,1065,6.0,False,False

In [72]:
sattotal.dtypes

state               object
participation17    float64
ebrw17               int64
math17               int64
total17              int64
participation18    float64
ebrw18               int64
math18               int64
total18              int64
participation19    float64
ebrw19               int64
math19               int64
total19              int64
gdp_rank_19        float64
sat_free              bool
act_free              bool
dtype: object

In [73]:
sattotal.shape

(50, 16)

### Importing an outside dataset that has population ranking data

In [74]:
population = pd.read_csv('../data/PopulationcsvData.csv', usecols = [0,1])

In [75]:
population.head()

   rank         State
0     1    California
1     2         Texas
2     3       Florida
3     4      New York
4     5  Pennsylvania

##### Renaming the rank column to population_rank just to not confuse the column post-merge with GDPRank

In [76]:
population.rename(columns = {'State':'state', 'rank': 'population_rank'}, inplace = True)

In [77]:
population.head()

   population_rank         state
0                1    California
1                2         Texas
2                3       Florida
3                4      New York
4                5  Pennsylvania

##### Dropping the state of Puerto Rico because it is not relevant to my analysis as neither total dataset is using Puerto Rico

In [78]:
statespopulation = population['state'].sort_values().values
state_excluded(statespopulation)

['Puerto Rico']

In [79]:
population.loc[population['state'] == 'Puerto Rico']

    population_rank        state
30               31  Puerto Rico

In [80]:
population.drop([30], inplace = True)
population.loc[population['state'] == 'Puerto Rico']

Empty DataFrame
Columns: [population_rank, state]
Index: []

#### Creating and applying a function to fix the rankings and adjust them after Puerto Rico's removal

In [81]:
def state_fix(x):
    if x > 31:
        return x - 1
    else:
        return x

In [82]:
population['population_rank'] = population['population_rank'].map(state_fix)

In [83]:
population.tail

<bound method NDFrame.tail of     population_rank                 state
0                 1            California
1                 2                 Texas
2                 3               Florida
3                 4              New York
4                 5          Pennsylvania
5                 6              Illinois
6                 7                  Ohio
7                 8               Georgia
8                 9        North Carolina
9                10              Michigan
10               11            New Jersey
11               12              Virginia
12               13            Washington
13               14               Arizona
14               15             Tennessee
15               16         Massachusetts
16               17               Indiana
17               18              Missouri
18               19              Maryland
19               20              Colorado
20               21             Wisconsin
21               22             Minnesota
22               23        South Carolina
23               24               Alabama
24               25             Louisiana
25               26              Kentucky
26               27                Oregon
27               28              Oklahoma
28               29           Connecticut
29               30                  Utah
31               31                Nevada
32               32                  Iowa
33               33              Arkansas
34               34           Mississippi
35               35                Kansas
36               36            New Mexico
37               37              Nebraska
38               38                 Idaho
39               39         West Virginia
40               40                Hawaii
41               41         New Hampshire
42               42                 Maine
43               43               Montana
44               44          Rhode Island
45               45              Delaware
46               46          South Dakota
47               47          North Dakota
48               48                Alaska
49               49  District of Columbia
50               50               Vermont
51               51               Wyoming>

#### Merging the population dataframe with the sattotal and acttotal datasets

In [84]:
acttotal = pd.merge(acttotal, population, on='state', how='left')

In [85]:
acttotal.head()

,state,participation17,composite17,participation18,composite18,participation19,composite19,gdp_rank_19,act_free,sat_free,population_rank
0,National,0.60,21.0,NaN,NaN,0.52,20.7,NaN,False,False,NaN
1,Alabama,1.00,19.2,1.00,19.1,1.00,18.9,46.0,True,False,24.0
2,Alaska,0.65,19.8,0.33,20.8,0.38,20.1,4.0,False,False,48.0
3,Arizona,0.62,19.7,0.66,19.2,0.73,19.0,41.0,False,False,14.0
4,Arkansas,1.00,19.4,1.00,19.4,1.00,19.3,49.0,True,False,33.0

In [86]:
sattotal = pd.merge(sattotal, population, on='state', how='left')

In [87]:
sattotal.head()

,state,participation17,ebrw17,math17,total17,participation18,ebrw18,math18,total18,participation19,ebrw19,math19,total19,gdp_rank_19,sat_free,act_free,population_rank
0,Alabama,0.05,593,572,1165,0.06,595,571,1166,0.07,583,560,1143,46.0,False,True,24
1,Alaska,0.38,547,533,1080,0.43,562,544,1106,0.41,556,541,1097,4.0,False,False,48
2,Arizona,0.30,563,553,1116,0.29,577,572,1149,0.31,569,565,1134,41.0,False,False,14
3,Arkansas,0.03,614,594,1208,0.05,592,576,1169,0.06,582,559,1141,49.0,False,True,33
4,California,0.53,531,524,1055,0.60,540,536,1076,0.63,534,531,1065,6.0,False,False,1

#### Converting the datasets to CSV's to apply them in the analysis and visualization notebook

In [88]:
acttotal.to_csv('../data/cleaned_data/acttotalclean.csv')
sattotal.to_csv('../data/cleaned_data/sattotalclean.csv')

In [89]:
act17.to_csv('../data/cleaned_data/act17newclean.csv')
act18.to_csv('../data/cleaned_data/act18newclean.csv')
act19.to_csv('../data/cleaned_data/act19newclean.csv')
sat17.to_csv('../data/cleaned_data/sat17newclean.csv')
sat18.to_csv('../data/cleaned_data/sat18newclean.csv')
sat19.to_csv('../data/cleaned_data/sat19newclean.csv')

In [90]:
actfree.to_csv('../data/cleaned_data/actfreecols.csv')
satfree.to_csv('../data/cleaned_data/satfreecols.csv')
GDPDF19.to_csv('../data/cleaned_data/gdp2019rank.csv')
population.to_csv('../data/cleaned_data/populationrank')